Revit 2027 API
AssetProperty.IsValidSchemaIdentifier Method
 Check that schema name is valid
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsValidSchemaIdentifier(
	string schemaID
)
Public Function IsValidSchemaIdentifier (
	schemaID As String
) As Boolean
public:
bool IsValidSchemaIdentifier(
	String^ schemaID
)
member IsValidSchemaIdentifier :
        schemaID : string -> bool
Parameters
schemaID String
 The schema name.
Return Value
Boolean
 True if the schema name is valid.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
InvalidOperationException |  Cannot check validity for a property not being edited in AppearanceAssetEditScope.
See Also
Reference
AssetProperty Class
Autodesk.Revit.DB.Visual Namespace